tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "warrensbox/tap"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Library for command-line editing
brew "readline"
# Address book with mutt support
brew "abook"
# Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode
brew "ansifilter"
# Spell checker with better logic than ispell
brew "aspell"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU database manager
brew "gdbm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Bash shell debugger
brew "bashdb"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Parser generator
brew "bison"
# Benchmark suite for file systems and hard drives
brew "bonnie++"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Freely available high-quality data compressor
brew "bzip2"
# Portable Foreign Function Interface library
brew "libffi"
# Object-file caching compiler wrapper
brew "ccache"
# Robust and modular log colorizer
brew "ccze"
# Checks for bashisms in shell scripts
brew "checkbashisms"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Ruby environment tool
brew "chruby"
# Cross-platform make
brew "cmake"
# Tool for service discovery, monitoring and configuration
brew "consul"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Standalone library of the Fraunhofer FDK AAC code from Android
brew "fdk-aac"
# Identify or delete duplicate files
brew "fdupes"
# Ogg Bitstream Library
brew "libogg"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# VP8/VP9 video codec
brew "libvpx"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# I/O benchmark and stress test
brew "fio"
# Lint your Python code for style and logical errors
brew "flake8"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# File system benchmark tool
brew "iozone"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Parallel bzip2 utility
brew "lbzip2"
# Convenience libraray for creating .opus files
brew "libopusenc"
# YAML Parser
brew "libyaml"
# Implementation of IEEE 802.1ab (LLDP)
brew "lldpd"
# Security and system auditing tool to harden systems
brew "lynis"
# Swiss Army Knife for macOS
brew "m-cli"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Metadata anonymization toolkit
brew "mat2"
# Java-based project management
brew "maven"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Mongrel of mail user agents (part elm, pine, mush, mh, etc.)
brew "mutt"
# Utility for managing network connections
brew "netcat"
# Port scanning utility for large networks
brew "nmap"
# Thread-based email index, search, and tagging
brew "notmuch"
# Manage multiple Node.js versions
brew "nvm"
# Synchronizes emails between two repositories
brew "offlineimap"
# Versatile passive OS fingerprinting, masquerade detection tool
brew "p0f"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Parchive: Parity Archive Volume Set for data recovery
brew "par2"
# Shell command parallelization utility
brew "parallel"
# Command-line tools for MySQL, MariaDB and system tasks
brew "percona-toolkit"
# Parallel gzip
brew "pigz"
# Data compressor
brew "plzip"
# Linter for prose
brew "proselint"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Cross-platform application and UI framework
brew "qt"
# Software environment for statistical computing
brew "r"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# SOcket CAT: netcat on steroids
brew "socat"
# Speex audio processing library
brew "speexdsp"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Tool to build, change, and version infrastructure
brew "terraform", link: false
# Improve Terraform's plan output
brew "terraform_landscape"
# Terminal multiplexer
brew "tmux"
# Ultimate terminal divider powered by tmux
brew "tmux-xpanes"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Extensible IRC client
brew "weechat"
# Internet file retriever
brew "wget"
# Graphical network analyzer and capture tool
brew "wireshark"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
# Time-frequency browser
cask "baudline"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# App for note taking, organizing, task lists, and archiving
cask "evernote"
cask "font-anonymice-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-space-mono"
cask "font-space-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
# Free and open-source image editor
cask "gimp"
cask "gitbook"
# Tools to protect your emails and files
cask "gpg-suite"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# End-to-end encryption software
cask "keybase"
# Create, manage and debug system- and user services
cask "launchcontrol"
# File system integration
cask "macfuse"
# App to write, plan, collaborate, and get organized
cask "notion"
# File system integration
cask "osxfuse"
# Time optimising application
cask "rescuetime"
# Data science software focusing on R and Python
cask "rstudio"
# Instant messaging application focusing on security
cask "signal"
# Screen capture tool with mark up and sharing features
cask "skitch"
# Team communication and collaboration software
cask "slack"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
cask "spotify"
# Messaging app with a focus on speed and security
cask "telegram"
cask "utc-menu-clock"
# Development environment
cask "vagrant"
cask "vagrant-manager"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark-chmodbpf"
# Mind mapping and brainstorming tool
cask "xmind"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
